results/MariaDB/Broadwell/events/dyni-select.log
sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            1811929
        write:                           0
        other:                           0
        total:                           1811929
    transactions:                        1811929 (30197.62 per sec.)
    queries:                             1811929 (30197.62 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0003s
    total number of events:              1811929

Latency (ms):
         min:                                  0.02
         avg:                                  0.03
         max:                                  1.58
         95th percentile:                      0.04
         sum:                              59071.96

Threads fairness:
    events (avg/stddev):           1811929.0000/0.00
    execution time (avg/stddev):   59.0720/0.00

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 2
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            3166622
        write:                           0
        other:                           0
        total:                           3166622
    transactions:                        3166622 (52774.94 per sec.)
    queries:                             3166622 (52774.94 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0003s
    total number of events:              3166622

Latency (ms):
         min:                                  0.02
         avg:                                  0.04
         max:                                  3.54
         95th percentile:                      0.05
         sum:                             117843.36

Threads fairness:
    events (avg/stddev):           1583311.0000/21792.00
    execution time (avg/stddev):   58.9217/0.01

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 4
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            5942421
        write:                           0
        other:                           0
        total:                           5942421
    transactions:                        5942421 (99036.36 per sec.)
    queries:                             5942421 (99036.36 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0003s
    total number of events:              5942421

Latency (ms):
         min:                                  0.03
         avg:                                  0.04
         max:                                  4.43
         95th percentile:                      0.04
         sum:                             235509.98

Threads fairness:
    events (avg/stddev):           1485605.2500/2947.21
    execution time (avg/stddev):   58.8775/0.02

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 8
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            7306642
        write:                           0
        other:                           0
        total:                           7306642
    transactions:                        7306642 (121771.80 per sec.)
    queries:                             7306642 (121771.80 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0007s
    total number of events:              7306642

Latency (ms):
         min:                                  0.03
         avg:                                  0.06
         max:                                 24.23
         95th percentile:                      0.07
         sum:                             470496.49

Threads fairness:
    events (avg/stddev):           913330.2500/2970.59
    execution time (avg/stddev):   58.8121/0.02

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 16
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            7219231
        write:                           0
        other:                           0
        total:                           7219231
    transactions:                        7219231 (120313.94 per sec.)
    queries:                             7219231 (120313.94 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0012s
    total number of events:              7219231

Latency (ms):
         min:                                  0.04
         avg:                                  0.13
         max:                                160.41
         95th percentile:                      0.15
         sum:                             950848.15

Threads fairness:
    events (avg/stddev):           451201.9375/1988.98
    execution time (avg/stddev):   59.4280/0.01

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            8884364
        write:                           0
        other:                           0
        total:                           8884364
    transactions:                        8884364 (148061.11 per sec.)
    queries:                             8884364 (148061.11 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0026s
    total number of events:              8884364

Latency (ms):
         min:                                  0.05
         avg:                                  0.22
         max:                                 17.11
         95th percentile:                      0.26
         sum:                            1910836.96

Threads fairness:
    events (avg/stddev):           277636.3750/2971.43
    execution time (avg/stddev):   59.7137/0.01

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 64
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            8659432
        write:                           0
        other:                           0
        total:                           8659432
    transactions:                        8659432 (144306.10 per sec.)
    queries:                             8659432 (144306.10 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0053s
    total number of events:              8659432

Latency (ms):
         min:                                  0.04
         avg:                                  0.44
         max:                                 46.04
         95th percentile:                      0.52
         sum:                            3829477.83

Threads fairness:
    events (avg/stddev):           135303.6250/2398.41
    execution time (avg/stddev):   59.8356/0.01

sysbench 1.0.8 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 128
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            7061920
        write:                           0
        other:                           0
        total:                           7061920
    transactions:                        7061920 (117671.14 per sec.)
    queries:                             7061920 (117671.14 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0121s
    total number of events:              7061920

Latency (ms):
         min:                                  0.04
         avg:                                  1.09
         max:                                137.78
         95th percentile:                      1.18
         sum:                            7667525.71

Threads fairness:
    events (avg/stddev):           55171.2500/1749.64
    execution time (avg/stddev):   59.9025/0.01